Kim-Hyundo/CSA_SW_TEST_SOLUTION/Workspace/GHS_Test/Target_SW/BSW/Modules/b_pf_autosar_tc39x_bundle/delivery/generic_TC39X_inc/IfxPsi5_reg.h
/** \brief 10C, Start of Frame Time Stamp Capture Register 1 */
#define PSI5_CH1_SFTSC /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_CH_SFTSC*)0xF000510Cu)
/** Alias (User Manual Name) for PSI5_CH1_SFTSC.
* To use register names with standard convension, please use PSI5_CH1_SFTSC.
*/
#define PSI5_SFTSC1 (PSI5_CH1_SFTSC)

/** \brief 110, Receive Data Register Low 1 */
#define PSI5_CH1_RDRL /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_CH_RDRL*)0xF0005110u)
/** Alias (User Manual Name) for PSI5_CH1_RDRL.
* To use register names with standard convension, please use PSI5_CH1_RDRL.
*/
#define PSI5_RDRL1 (PSI5_CH1_RDRL)

/** \brief 114, Receive Data Register High 1 */
#define PSI5_CH1_RDRH /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_CH_RDRH*)0xF0005114u)
/** Alias (User Manual Name) for PSI5_CH1_RDRH.
* To use register names with standard convension, please use PSI5_CH1_RDRH.
*/
#define PSI5_RDRH1 (PSI5_CH1_RDRH)

/** \brief 118, Pulse Generation Control Register 1 */
#define PSI5_CH1_PGC /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_CH_PGC*)0xF0005118u)
/** Alias (User Manual Name) for PSI5_CH1_PGC.
* To use register names with standard convension, please use PSI5_CH1_PGC.
*/
#define PSI5_PGC1 (PSI5_CH1_PGC)

/** \brief 11C, Channel Trigger Value Register 1 */
#define PSI5_CH1_CTV /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_CH_CTV*)0xF000511Cu)
/** Alias (User Manual Name) for PSI5_CH1_CTV.
* To use register names with standard convension, please use PSI5_CH1_CTV.
*/
#define PSI5_CTV1 (PSI5_CH1_CTV)

/** \brief 120, Send Control Register 1 */
#define PSI5_CH1_SCR /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_CH_SCR*)0xF0005120u)
/** Alias (User Manual Name) for PSI5_CH1_SCR.
* To use register names with standard convension, please use PSI5_CH1_SCR.
*/
#define PSI5_SCR1 (PSI5_CH1_SCR)

/** \brief 124, Send Data Register Low 1 */
#define PSI5_CH1_SDRL /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_CH_SDRL*)0xF0005124u)
/** Alias (User Manual Name) for PSI5_CH1_SDRL.
* To use register names with standard convension, please use PSI5_CH1_SDRL.
*/
#define PSI5_SDRL1 (PSI5_CH1_SDRL)

/** \brief 128, Send Data Register High 1 */
#define PSI5_CH1_SDRH /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_CH_SDRH*)0xF0005128u)
/** Alias (User Manual Name) for PSI5_CH1_SDRH.
* To use register names with standard convension, please use PSI5_CH1_SDRH.
*/
#define PSI5_SDRH1 (PSI5_CH1_SDRH)

/** \brief 12C, Send Shift Register Low 1 */
#define PSI5_CH1_SSRL /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_CH_SSRL*)0xF000512Cu)
/** Alias (User Manual Name) for PSI5_CH1_SSRL.
* To use register names with standard convension, please use PSI5_CH1_SSRL.
*/
#define PSI5_SSRL1 (PSI5_CH1_SSRL)

/** \brief 130, Send Shift Register High 1 */
#define PSI5_CH1_SSRH /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_CH_SSRH*)0xF0005130u)
/** Alias (User Manual Name) for PSI5_CH1_SSRH.
* To use register names with standard convension, please use PSI5_CH1_SSRH.
*/
#define PSI5_SSRH1 (PSI5_CH1_SSRH)

/** \brief 134, Send Output Register Low 1 */
#define PSI5_CH1_SORL /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_CH_SORL*)0xF0005134u)
/** Alias (User Manual Name) for PSI5_CH1_SORL.
* To use register names with standard convension, please use PSI5_CH1_SORL.
*/
#define PSI5_SORL1 (PSI5_CH1_SORL)

/** \brief 138, Send Output Register High 1 */
#define PSI5_CH1_SORH /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_CH_SORH*)0xF0005138u)
/** Alias (User Manual Name) for PSI5_CH1_SORH.
* To use register names with standard convension, please use PSI5_CH1_SORH.
*/
#define PSI5_SORH1 (PSI5_CH1_SORH)

/** \brief 150, Input and Output Control Register 2 */
#define PSI5_CH2_IOCR /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_CH_IOCR*)0xF0005150u)
/** Alias (User Manual Name) for PSI5_CH2_IOCR.
* To use register names with standard convension, please use PSI5_CH2_IOCR.
*/
#define PSI5_IOCR2 (PSI5_CH2_IOCR)

/** \brief 154, Receiver Control Register A 2 */
#define PSI5_CH2_RCRA /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_CH_RCRA*)0xF0005154u)
/** Alias (User Manual Name) for PSI5_CH2_RCRA.
* To use register names with standard convension, please use PSI5_CH2_RCRA.
*/
#define PSI5_RCRA2 (PSI5_CH2_RCRA)

/** \brief 158, Receiver Control Register B 2 */
#define PSI5_CH2_RCRB /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_CH_RCRB*)0xF0005158u)
/** Alias (User Manual Name) for PSI5_CH2_RCRB.
* To use register names with standard convension, please use PSI5_CH2_RCRB.
*/
#define PSI5_RCRB2 (PSI5_CH2_RCRB)

/** \brief 15C, Receiver Control Register C 2 */
#define PSI5_CH2_RCRC /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_CH_RCRC*)0xF000515Cu)
/** Alias (User Manual Name) for PSI5_CH2_RCRC.
* To use register names with standard convension, please use PSI5_CH2_RCRC.
*/
#define PSI5_RCRC2 (PSI5_CH2_RCRC)

/** \brief 160, Watch Dog Timer Register 20 */
#define PSI5_CH2_WDT0 /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_CH_WDT*)0xF0005160u)
/** Alias (User Manual Name) for PSI5_CH2_WDT0.
* To use register names with standard convension, please use PSI5_CH2_WDT0.
*/
#define PSI5_WDT20 (PSI5_CH2_WDT0)

/** \brief 164, Watch Dog Timer Register 21 */
#define PSI5_CH2_WDT1 /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_CH_WDT*)0xF0005164u)
/** Alias (User Manual Name) for PSI5_CH2_WDT1.
* To use register names with standard convension, please use PSI5_CH2_WDT1.
*/
#define PSI5_WDT21 (PSI5_CH2_WDT1)

/** \brief 168, Watch Dog Timer Register 22 */
#define PSI5_CH2_WDT2 /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_CH_WDT*)0xF0005168u)
/** Alias (User Manual Name) for PSI5_CH2_WDT2.
* To use register names with standard convension, please use PSI5_CH2_WDT2.
*/
#define PSI5_WDT22 (PSI5_CH2_WDT2)

/** \brief 16C, Watch Dog Timer Register 23 */
#define PSI5_CH2_WDT3 /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_CH_WDT*)0xF000516Cu)
/** Alias (User Manual Name) for PSI5_CH2_WDT3.
* To use register names with standard convension, please use PSI5_CH2_WDT3.
*/
#define PSI5_WDT23 (PSI5_CH2_WDT3)

/** \brief 170, Watch Dog Timer Register 24 */
#define PSI5_CH2_WDT4 /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_CH_WDT*)0xF0005170u)
/** Alias (User Manual Name) for PSI5_CH2_WDT4.
* To use register names with standard convension, please use PSI5_CH2_WDT4.
*/
#define PSI5_WDT24 (PSI5_CH2_WDT4)

/** \brief 174, Watch Dog Timer Register 25 */
#define PSI5_CH2_WDT5 /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_CH_WDT*)0xF0005174u)
/** Alias (User Manual Name) for PSI5_CH2_WDT5.
* To use register names with standard convension, please use PSI5_CH2_WDT5.
*/
#define PSI5_WDT25 (PSI5_CH2_WDT5)

/** \brief 178, Watch Dog Timer Register 26 */
#define PSI5_CH2_WDT6 /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_CH_WDT*)0xF0005178u)
/** Alias (User Manual Name) for PSI5_CH2_WDT6.
* To use register names with standard convension, please use PSI5_CH2_WDT6.
*/
#define PSI5_WDT26 (PSI5_CH2_WDT6)

/** \brief 17C, Receive Status Register 2 */
#define PSI5_CH2_RSR /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_CH_RSR*)0xF000517Cu)
/** Alias (User Manual Name) for PSI5_CH2_RSR.
* To use register names with standard convension, please use PSI5_CH2_RSR.
*/
#define PSI5_RSR2 (PSI5_CH2_RSR)

/** \brief 180, Serial Data and Status Register 20 */
#define PSI5_CH2_SDS0 /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_CH_SDS*)0xF0005180u)
/** Alias (User Manual Name) for PSI5_CH2_SDS0.
* To use register names with standard convension, please use PSI5_CH2_SDS0.
*/
#define PSI5_SDS20 (PSI5_CH2_SDS0)

/** \brief 184, Serial Data and Status Register 21 */
#define PSI5_CH2_SDS1 /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_CH_SDS*)0xF0005184u)
/** Alias (User Manual Name) for PSI5_CH2_SDS1.
* To use register names with standard convension, please use PSI5_CH2_SDS1.
*/
#define PSI5_SDS21 (PSI5_CH2_SDS1)

/** \brief 188, Serial Data and Status Register 22 */
#define PSI5_CH2_SDS2 /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_CH_SDS*)0xF0005188u)
/** Alias (User Manual Name) for PSI5_CH2_SDS2.
* To use register names with standard convension, please use PSI5_CH2_SDS2.
*/
#define PSI5_SDS22 (PSI5_CH2_SDS2)

/** \brief 18C, Serial Data and Status Register 23 */
#define PSI5_CH2_SDS3 /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_CH_SDS*)0xF000518Cu)
/** Alias (User Manual Name) for PSI5_CH2_SDS3.
* To use register names with standard convension, please use PSI5_CH2_SDS3.
*/
#define PSI5_SDS23 (PSI5_CH2_SDS3)

/** \brief 190, Serial Data and Status Register 24 */
#define PSI5_CH2_SDS4 /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_CH_SDS*)0xF0005190u)
/** Alias (User Manual Name) for PSI5_CH2_SDS4.
* To use register names with standard convension, please use PSI5_CH2_SDS4.
*/
#define PSI5_SDS24 (PSI5_CH2_SDS4)

/** \brief 194, Serial Data and Status Register 25 */
#define PSI5_CH2_SDS5 /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_CH_SDS*)0xF0005194u)
/** Alias (User Manual Name) for PSI5_CH2_SDS5.
* To use register names with standard convension, please use PSI5_CH2_SDS5.
*/
#define PSI5_SDS25 (PSI5_CH2_SDS5)

/** \brief 198, Start of Pulse Time Stamp Capture Register 2 */
#define PSI5_CH2_SPTSC /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_CH_SPTSC*)0xF0005198u)
/** Alias (User Manual Name) for PSI5_CH2_SPTSC.
* To use register names with standard convension, please use PSI5_CH2_SPTSC.
*/
#define PSI5_SPTSC2 (PSI5_CH2_SPTSC)

