Kim-Hyundo/CSA_SW_TEST_SOLUTION/Workspace/GHS_Test/Target_SW/BSW/Modules/b_pf_autosar_tc39x_bundle/delivery/generic_TC39X_inc/IfxPsi5_reg.h
/** \brief 19C, Start of Frame Time Stamp Capture Register 2 */
#define PSI5_CH2_SFTSC /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_CH_SFTSC*)0xF000519Cu)
/** Alias (User Manual Name) for PSI5_CH2_SFTSC.
* To use register names with standard convension, please use PSI5_CH2_SFTSC.
*/
#define PSI5_SFTSC2 (PSI5_CH2_SFTSC)

/** \brief 1A0, Receive Data Register Low 2 */
#define PSI5_CH2_RDRL /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_CH_RDRL*)0xF00051A0u)
/** Alias (User Manual Name) for PSI5_CH2_RDRL.
* To use register names with standard convension, please use PSI5_CH2_RDRL.
*/
#define PSI5_RDRL2 (PSI5_CH2_RDRL)

/** \brief 1A4, Receive Data Register High 2 */
#define PSI5_CH2_RDRH /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_CH_RDRH*)0xF00051A4u)
/** Alias (User Manual Name) for PSI5_CH2_RDRH.
* To use register names with standard convension, please use PSI5_CH2_RDRH.
*/
#define PSI5_RDRH2 (PSI5_CH2_RDRH)

/** \brief 1A8, Pulse Generation Control Register 2 */
#define PSI5_CH2_PGC /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_CH_PGC*)0xF00051A8u)
/** Alias (User Manual Name) for PSI5_CH2_PGC.
* To use register names with standard convension, please use PSI5_CH2_PGC.
*/
#define PSI5_PGC2 (PSI5_CH2_PGC)

/** \brief 1AC, Channel Trigger Value Register 2 */
#define PSI5_CH2_CTV /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_CH_CTV*)0xF00051ACu)
/** Alias (User Manual Name) for PSI5_CH2_CTV.
* To use register names with standard convension, please use PSI5_CH2_CTV.
*/
#define PSI5_CTV2 (PSI5_CH2_CTV)

/** \brief 1B0, Send Control Register 2 */
#define PSI5_CH2_SCR /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_CH_SCR*)0xF00051B0u)
/** Alias (User Manual Name) for PSI5_CH2_SCR.
* To use register names with standard convension, please use PSI5_CH2_SCR.
*/
#define PSI5_SCR2 (PSI5_CH2_SCR)

/** \brief 1B4, Send Data Register Low 2 */
#define PSI5_CH2_SDRL /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_CH_SDRL*)0xF00051B4u)
/** Alias (User Manual Name) for PSI5_CH2_SDRL.
* To use register names with standard convension, please use PSI5_CH2_SDRL.
*/
#define PSI5_SDRL2 (PSI5_CH2_SDRL)

/** \brief 1B8, Send Data Register High 2 */
#define PSI5_CH2_SDRH /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_CH_SDRH*)0xF00051B8u)
/** Alias (User Manual Name) for PSI5_CH2_SDRH.
* To use register names with standard convension, please use PSI5_CH2_SDRH.
*/
#define PSI5_SDRH2 (PSI5_CH2_SDRH)

/** \brief 1BC, Send Shift Register Low 2 */
#define PSI5_CH2_SSRL /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_CH_SSRL*)0xF00051BCu)
/** Alias (User Manual Name) for PSI5_CH2_SSRL.
* To use register names with standard convension, please use PSI5_CH2_SSRL.
*/
#define PSI5_SSRL2 (PSI5_CH2_SSRL)

/** \brief 1C0, Send Shift Register High 2 */
#define PSI5_CH2_SSRH /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_CH_SSRH*)0xF00051C0u)
/** Alias (User Manual Name) for PSI5_CH2_SSRH.
* To use register names with standard convension, please use PSI5_CH2_SSRH.
*/
#define PSI5_SSRH2 (PSI5_CH2_SSRH)

/** \brief 1C4, Send Output Register Low 2 */
#define PSI5_CH2_SORL /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_CH_SORL*)0xF00051C4u)
/** Alias (User Manual Name) for PSI5_CH2_SORL.
* To use register names with standard convension, please use PSI5_CH2_SORL.
*/
#define PSI5_SORL2 (PSI5_CH2_SORL)

/** \brief 1C8, Send Output Register High 2 */
#define PSI5_CH2_SORH /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_CH_SORH*)0xF00051C8u)
/** Alias (User Manual Name) for PSI5_CH2_SORH.
* To use register names with standard convension, please use PSI5_CH2_SORH.
*/
#define PSI5_SORH2 (PSI5_CH2_SORH)

/** \brief 1E0, Input and Output Control Register 3 */
#define PSI5_CH3_IOCR /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_CH_IOCR*)0xF00051E0u)
/** Alias (User Manual Name) for PSI5_CH3_IOCR.
* To use register names with standard convension, please use PSI5_CH3_IOCR.
*/
#define PSI5_IOCR3 (PSI5_CH3_IOCR)

/** \brief 1E4, Receiver Control Register A 3 */
#define PSI5_CH3_RCRA /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_CH_RCRA*)0xF00051E4u)
/** Alias (User Manual Name) for PSI5_CH3_RCRA.
* To use register names with standard convension, please use PSI5_CH3_RCRA.
*/
#define PSI5_RCRA3 (PSI5_CH3_RCRA)

/** \brief 1E8, Receiver Control Register B 3 */
#define PSI5_CH3_RCRB /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_CH_RCRB*)0xF00051E8u)
/** Alias (User Manual Name) for PSI5_CH3_RCRB.
* To use register names with standard convension, please use PSI5_CH3_RCRB.
*/
#define PSI5_RCRB3 (PSI5_CH3_RCRB)

/** \brief 1EC, Receiver Control Register C 3 */
#define PSI5_CH3_RCRC /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_CH_RCRC*)0xF00051ECu)
/** Alias (User Manual Name) for PSI5_CH3_RCRC.
* To use register names with standard convension, please use PSI5_CH3_RCRC.
*/
#define PSI5_RCRC3 (PSI5_CH3_RCRC)

/** \brief 1F0, Watch Dog Timer Register 30 */
#define PSI5_CH3_WDT0 /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_CH_WDT*)0xF00051F0u)
/** Alias (User Manual Name) for PSI5_CH3_WDT0.
* To use register names with standard convension, please use PSI5_CH3_WDT0.
*/
#define PSI5_WDT30 (PSI5_CH3_WDT0)

/** \brief 1F4, Watch Dog Timer Register 31 */
#define PSI5_CH3_WDT1 /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_CH_WDT*)0xF00051F4u)
/** Alias (User Manual Name) for PSI5_CH3_WDT1.
* To use register names with standard convension, please use PSI5_CH3_WDT1.
*/
#define PSI5_WDT31 (PSI5_CH3_WDT1)

/** \brief 1F8, Watch Dog Timer Register 32 */
#define PSI5_CH3_WDT2 /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_CH_WDT*)0xF00051F8u)
/** Alias (User Manual Name) for PSI5_CH3_WDT2.
* To use register names with standard convension, please use PSI5_CH3_WDT2.
*/
#define PSI5_WDT32 (PSI5_CH3_WDT2)

/** \brief 1FC, Watch Dog Timer Register 33 */
#define PSI5_CH3_WDT3 /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_CH_WDT*)0xF00051FCu)
/** Alias (User Manual Name) for PSI5_CH3_WDT3.
* To use register names with standard convension, please use PSI5_CH3_WDT3.
*/
#define PSI5_WDT33 (PSI5_CH3_WDT3)

/** \brief 200, Watch Dog Timer Register 34 */
#define PSI5_CH3_WDT4 /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_CH_WDT*)0xF0005200u)
/** Alias (User Manual Name) for PSI5_CH3_WDT4.
* To use register names with standard convension, please use PSI5_CH3_WDT4.
*/
#define PSI5_WDT34 (PSI5_CH3_WDT4)

/** \brief 204, Watch Dog Timer Register 35 */
#define PSI5_CH3_WDT5 /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_CH_WDT*)0xF0005204u)
/** Alias (User Manual Name) for PSI5_CH3_WDT5.
* To use register names with standard convension, please use PSI5_CH3_WDT5.
*/
#define PSI5_WDT35 (PSI5_CH3_WDT5)

/** \brief 208, Watch Dog Timer Register 36 */
#define PSI5_CH3_WDT6 /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_CH_WDT*)0xF0005208u)
/** Alias (User Manual Name) for PSI5_CH3_WDT6.
* To use register names with standard convension, please use PSI5_CH3_WDT6.
*/
#define PSI5_WDT36 (PSI5_CH3_WDT6)

/** \brief 20C, Receive Status Register 3 */
#define PSI5_CH3_RSR /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_CH_RSR*)0xF000520Cu)
/** Alias (User Manual Name) for PSI5_CH3_RSR.
* To use register names with standard convension, please use PSI5_CH3_RSR.
*/
#define PSI5_RSR3 (PSI5_CH3_RSR)

/** \brief 210, Serial Data and Status Register 30 */
#define PSI5_CH3_SDS0 /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_CH_SDS*)0xF0005210u)
/** Alias (User Manual Name) for PSI5_CH3_SDS0.
* To use register names with standard convension, please use PSI5_CH3_SDS0.
*/
#define PSI5_SDS30 (PSI5_CH3_SDS0)

/** \brief 214, Serial Data and Status Register 31 */
#define PSI5_CH3_SDS1 /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_CH_SDS*)0xF0005214u)
/** Alias (User Manual Name) for PSI5_CH3_SDS1.
* To use register names with standard convension, please use PSI5_CH3_SDS1.
*/
#define PSI5_SDS31 (PSI5_CH3_SDS1)

/** \brief 218, Serial Data and Status Register 32 */
#define PSI5_CH3_SDS2 /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_CH_SDS*)0xF0005218u)
/** Alias (User Manual Name) for PSI5_CH3_SDS2.
* To use register names with standard convension, please use PSI5_CH3_SDS2.
*/
#define PSI5_SDS32 (PSI5_CH3_SDS2)

