Kim-Hyundo/CSA_SW_TEST_SOLUTION/Workspace/GHS_Test/Target_SW/BSW/Modules/b_pf_autosar_tc39x_bundle/delivery/generic_TC39X_inc/IfxPsi5_reg.h
/** \brief 514, RDI Overview Set Register 1 */
#define PSI5_RDISET1 /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RDISET*)0xF0005514u)

/** \brief 518, RDI Overview Set Register 2 */
#define PSI5_RDISET2 /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RDISET*)0xF0005518u)

/** \brief 51C, RDI Overview Set Register 3 */
#define PSI5_RDISET3 /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RDISET*)0xF000551Cu)

/** \brief 524, NFI Overview Set Register 0 */
#define PSI5_NFISET0 /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_NFISET*)0xF0005524u)

/** \brief 528, NFI Overview Set Register 1 */
#define PSI5_NFISET1 /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_NFISET*)0xF0005528u)

/** \brief 52C, NFI Overview Set Register 2 */
#define PSI5_NFISET2 /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_NFISET*)0xF000552Cu)

/** \brief 530, NFI Overview Set Register 3 */
#define PSI5_NFISET3 /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_NFISET*)0xF0005530u)

/** \brief 538, MEI Overview Set Register 0 */
#define PSI5_MEISET0 /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_MEISET*)0xF0005538u)

/** \brief 53C, MEI Overview Set Register 1 */
#define PSI5_MEISET1 /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_MEISET*)0xF000553Cu)

/** \brief 540, MEI Overview Set Register 2 */
#define PSI5_MEISET2 /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_MEISET*)0xF0005540u)

/** \brief 544, MEI Overview Set Register 3 */
#define PSI5_MEISET3 /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_MEISET*)0xF0005544u)

/** \brief 54C, RSI Overview Clear Register 0 */
#define PSI5_RSICLR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RSICLR*)0xF000554Cu)

/** \brief 550, RSI Overview Clear Register 1 */
#define PSI5_RSICLR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RSICLR*)0xF0005550u)

/** \brief 554, RSI Overview Clear Register 2 */
#define PSI5_RSICLR2 /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RSICLR*)0xF0005554u)

/** \brief 558, RSI Overview Clear Register 3 */
#define PSI5_RSICLR3 /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RSICLR*)0xF0005558u)

/** \brief 560, RMI Overview Clear Register 0 */
#define PSI5_RMICLR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RMICLR*)0xF0005560u)

/** \brief 564, RMI Overview Clear Register 1 */
#define PSI5_RMICLR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RMICLR*)0xF0005564u)

/** \brief 568, RMI Overview Clear Register 2 */
#define PSI5_RMICLR2 /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RMICLR*)0xF0005568u)

/** \brief 56C, RMI Overview Clear Register 3 */
#define PSI5_RMICLR3 /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RMICLR*)0xF000556Cu)

/** \brief 574, NBI Overview Clear Register 0 */
#define PSI5_NBICLR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_NBICLR*)0xF0005574u)

/** \brief 578, NBI Overview Clear Register 1 */
#define PSI5_NBICLR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_NBICLR*)0xF0005578u)

/** \brief 57C, NBI Overview Clear Register 2 */
#define PSI5_NBICLR2 /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_NBICLR*)0xF000557Cu)

/** \brief 580, NBI Overview Clear Register 3 */
#define PSI5_NBICLR3 /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_NBICLR*)0xF0005580u)

/** \brief 588, TEI Overview Clear Register 0 */
#define PSI5_TEICLR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_TEICLR*)0xF0005588u)

/** \brief 58C, TEI Overview Clear Register 1 */
#define PSI5_TEICLR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_TEICLR*)0xF000558Cu)

/** \brief 590, TEI Overview Clear Register 2 */
#define PSI5_TEICLR2 /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_TEICLR*)0xF0005590u)

/** \brief 594, TEI Overview Clear Register 3 */
#define PSI5_TEICLR3 /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_TEICLR*)0xF0005594u)

/** \brief 59C, CRCI Overview Clear Register 0 */
#define PSI5_CRCICLR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_CRCICLR*)0xF000559Cu)

/** \brief 5A0, CRCI Overview Clear Register 1 */
#define PSI5_CRCICLR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_CRCICLR*)0xF00055A0u)

/** \brief 5A4, CRCI Overview Clear Register 2 */
#define PSI5_CRCICLR2 /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_CRCICLR*)0xF00055A4u)

/** \brief 5A8, CRCI Overview Clear Register 3 */
#define PSI5_CRCICLR3 /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_CRCICLR*)0xF00055A8u)

/** \brief 5B0, RDI Overview Clear Register 0 */
#define PSI5_RDICLR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RDICLR*)0xF00055B0u)

/** \brief 5B4, RDI Overview Clear Register 1 */
#define PSI5_RDICLR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RDICLR*)0xF00055B4u)

/** \brief 5B8, RDI Overview Clear Register 2 */
#define PSI5_RDICLR2 /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RDICLR*)0xF00055B8u)

/** \brief 5BC, RDI Overview Clear Register 3 */
#define PSI5_RDICLR3 /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RDICLR*)0xF00055BCu)

/** \brief 5C4, NFI Overview Clear Register 0 */
#define PSI5_NFICLR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_NFICLR*)0xF00055C4u)

/** \brief 5C8, NFI Overview Clear Register 1 */
#define PSI5_NFICLR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_NFICLR*)0xF00055C8u)

/** \brief 5CC, NFI Overview Clear Register 2 */
#define PSI5_NFICLR2 /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_NFICLR*)0xF00055CCu)

/** \brief 5D0, NFI Overview Clear Register 3 */
#define PSI5_NFICLR3 /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_NFICLR*)0xF00055D0u)

/** \brief 5D8, MEI Overview Clear Register 0 */
#define PSI5_MEICLR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_MEICLR*)0xF00055D8u)

/** \brief 5DC, MEI Overview Clear Register 1 */
#define PSI5_MEICLR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_MEICLR*)0xF00055DCu)

/** \brief 5E0, MEI Overview Clear Register 2 */
#define PSI5_MEICLR2 /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_MEICLR*)0xF00055E0u)

/** \brief 5E4, MEI Overview Clear Register 3 */
#define PSI5_MEICLR3 /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_MEICLR*)0xF00055E4u)

/** \brief 600, Receive Data Memory Low 00 */
#define PSI5_RDM0_0_L /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RDM_L*)0xF0005600u)
/** Alias (User Manual Name) for PSI5_RDM0_0_L.
* To use register names with standard convension, please use PSI5_RDM0_0_L.
*/
#define PSI5_RDML00 (PSI5_RDM0_0_L)

/** \brief 604, Receive Data Memory High 00 */
#define PSI5_RDM0_0_H /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RDM_H*)0xF0005604u)
/** Alias (User Manual Name) for PSI5_RDM0_0_H.
* To use register names with standard convension, please use PSI5_RDM0_0_H.
*/
#define PSI5_RDMH00 (PSI5_RDM0_0_H)

/** \brief 608, Receive Data Memory Low 01 */
#define PSI5_RDM0_1_L /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RDM_L*)0xF0005608u)
/** Alias (User Manual Name) for PSI5_RDM0_1_L.
* To use register names with standard convension, please use PSI5_RDM0_1_L.
*/
#define PSI5_RDML01 (PSI5_RDM0_1_L)

/** \brief 60C, Receive Data Memory High 01 */
#define PSI5_RDM0_1_H /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RDM_H*)0xF000560Cu)
/** Alias (User Manual Name) for PSI5_RDM0_1_H.
* To use register names with standard convension, please use PSI5_RDM0_1_H.
*/
#define PSI5_RDMH01 (PSI5_RDM0_1_H)

