Kim-Hyundo/CSA_SW_TEST_SOLUTION/Workspace/GHS_Test/Target_SW/BSW/Modules/b_pf_autosar_tc39x_bundle/delivery/generic_TC39X_inc/IfxPsi5_reg.h
/** \brief 734, Receive Data Memory High 16 */
#define PSI5_RDM1_6_H /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RDM_H*)0xF0005734u)
/** Alias (User Manual Name) for PSI5_RDM1_6_H.
* To use register names with standard convension, please use PSI5_RDM1_6_H.
*/
#define PSI5_RDMH16 (PSI5_RDM1_6_H)

/** \brief 738, Receive Data Memory Low 17 */
#define PSI5_RDM1_7_L /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RDM_L*)0xF0005738u)
/** Alias (User Manual Name) for PSI5_RDM1_7_L.
* To use register names with standard convension, please use PSI5_RDM1_7_L.
*/
#define PSI5_RDML17 (PSI5_RDM1_7_L)

/** \brief 73C, Receive Data Memory High 17 */
#define PSI5_RDM1_7_H /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RDM_H*)0xF000573Cu)
/** Alias (User Manual Name) for PSI5_RDM1_7_H.
* To use register names with standard convension, please use PSI5_RDM1_7_H.
*/
#define PSI5_RDMH17 (PSI5_RDM1_7_H)

/** \brief 740, Receive Data Memory Low 18 */
#define PSI5_RDM1_8_L /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RDM_L*)0xF0005740u)
/** Alias (User Manual Name) for PSI5_RDM1_8_L.
* To use register names with standard convension, please use PSI5_RDM1_8_L.
*/
#define PSI5_RDML18 (PSI5_RDM1_8_L)

/** \brief 744, Receive Data Memory High 18 */
#define PSI5_RDM1_8_H /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RDM_H*)0xF0005744u)
/** Alias (User Manual Name) for PSI5_RDM1_8_H.
* To use register names with standard convension, please use PSI5_RDM1_8_H.
*/
#define PSI5_RDMH18 (PSI5_RDM1_8_H)

/** \brief 748, Receive Data Memory Low 19 */
#define PSI5_RDM1_9_L /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RDM_L*)0xF0005748u)
/** Alias (User Manual Name) for PSI5_RDM1_9_L.
* To use register names with standard convension, please use PSI5_RDM1_9_L.
*/
#define PSI5_RDML19 (PSI5_RDM1_9_L)

/** \brief 74C, Receive Data Memory High 19 */
#define PSI5_RDM1_9_H /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RDM_H*)0xF000574Cu)
/** Alias (User Manual Name) for PSI5_RDM1_9_H.
* To use register names with standard convension, please use PSI5_RDM1_9_H.
*/
#define PSI5_RDMH19 (PSI5_RDM1_9_H)

/** \brief 750, Receive Data Memory Low 110 */
#define PSI5_RDM1_10_L /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RDM_L*)0xF0005750u)
/** Alias (User Manual Name) for PSI5_RDM1_10_L.
* To use register names with standard convension, please use PSI5_RDM1_10_L.
*/
#define PSI5_RDML110 (PSI5_RDM1_10_L)

/** \brief 754, Receive Data Memory High 110 */
#define PSI5_RDM1_10_H /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RDM_H*)0xF0005754u)
/** Alias (User Manual Name) for PSI5_RDM1_10_H.
* To use register names with standard convension, please use PSI5_RDM1_10_H.
*/
#define PSI5_RDMH110 (PSI5_RDM1_10_H)

/** \brief 758, Receive Data Memory Low 111 */
#define PSI5_RDM1_11_L /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RDM_L*)0xF0005758u)
/** Alias (User Manual Name) for PSI5_RDM1_11_L.
* To use register names with standard convension, please use PSI5_RDM1_11_L.
*/
#define PSI5_RDML111 (PSI5_RDM1_11_L)

/** \brief 75C, Receive Data Memory High 111 */
#define PSI5_RDM1_11_H /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RDM_H*)0xF000575Cu)
/** Alias (User Manual Name) for PSI5_RDM1_11_H.
* To use register names with standard convension, please use PSI5_RDM1_11_H.
*/
#define PSI5_RDMH111 (PSI5_RDM1_11_H)

/** \brief 760, Receive Data Memory Low 112 */
#define PSI5_RDM1_12_L /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RDM_L*)0xF0005760u)
/** Alias (User Manual Name) for PSI5_RDM1_12_L.
* To use register names with standard convension, please use PSI5_RDM1_12_L.
*/
#define PSI5_RDML112 (PSI5_RDM1_12_L)

/** \brief 764, Receive Data Memory High 112 */
#define PSI5_RDM1_12_H /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RDM_H*)0xF0005764u)
/** Alias (User Manual Name) for PSI5_RDM1_12_H.
* To use register names with standard convension, please use PSI5_RDM1_12_H.
*/
#define PSI5_RDMH112 (PSI5_RDM1_12_H)

/** \brief 768, Receive Data Memory Low 113 */
#define PSI5_RDM1_13_L /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RDM_L*)0xF0005768u)
/** Alias (User Manual Name) for PSI5_RDM1_13_L.
* To use register names with standard convension, please use PSI5_RDM1_13_L.
*/
#define PSI5_RDML113 (PSI5_RDM1_13_L)

/** \brief 76C, Receive Data Memory High 113 */
#define PSI5_RDM1_13_H /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RDM_H*)0xF000576Cu)
/** Alias (User Manual Name) for PSI5_RDM1_13_H.
* To use register names with standard convension, please use PSI5_RDM1_13_H.
*/
#define PSI5_RDMH113 (PSI5_RDM1_13_H)

/** \brief 770, Receive Data Memory Low 114 */
#define PSI5_RDM1_14_L /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RDM_L*)0xF0005770u)
/** Alias (User Manual Name) for PSI5_RDM1_14_L.
* To use register names with standard convension, please use PSI5_RDM1_14_L.
*/
#define PSI5_RDML114 (PSI5_RDM1_14_L)

/** \brief 774, Receive Data Memory High 114 */
#define PSI5_RDM1_14_H /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RDM_H*)0xF0005774u)
/** Alias (User Manual Name) for PSI5_RDM1_14_H.
* To use register names with standard convension, please use PSI5_RDM1_14_H.
*/
#define PSI5_RDMH114 (PSI5_RDM1_14_H)

/** \brief 778, Receive Data Memory Low 115 */
#define PSI5_RDM1_15_L /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RDM_L*)0xF0005778u)
/** Alias (User Manual Name) for PSI5_RDM1_15_L.
* To use register names with standard convension, please use PSI5_RDM1_15_L.
*/
#define PSI5_RDML115 (PSI5_RDM1_15_L)

/** \brief 77C, Receive Data Memory High 115 */
#define PSI5_RDM1_15_H /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RDM_H*)0xF000577Cu)
/** Alias (User Manual Name) for PSI5_RDM1_15_H.
* To use register names with standard convension, please use PSI5_RDM1_15_H.
*/
#define PSI5_RDMH115 (PSI5_RDM1_15_H)

/** \brief 780, Receive Data Memory Low 116 */
#define PSI5_RDM1_16_L /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RDM_L*)0xF0005780u)
/** Alias (User Manual Name) for PSI5_RDM1_16_L.
* To use register names with standard convension, please use PSI5_RDM1_16_L.
*/
#define PSI5_RDML116 (PSI5_RDM1_16_L)

