Kim-Hyundo/CSA_SW_TEST_SOLUTION/Workspace/GHS_Test/Target_SW/BSW/Modules/b_pf_autosar_tc39x_bundle/delivery/generic_TC39X_inc/IfxPsi5_reg.h
/** \brief 880, Receive Data Memory Low 216 */
#define PSI5_RDM2_16_L /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RDM_L*)0xF0005880u)
/** Alias (User Manual Name) for PSI5_RDM2_16_L.
* To use register names with standard convension, please use PSI5_RDM2_16_L.
*/
#define PSI5_RDML216 (PSI5_RDM2_16_L)

/** \brief 884, Receive Data Memory High 216 */
#define PSI5_RDM2_16_H /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RDM_H*)0xF0005884u)
/** Alias (User Manual Name) for PSI5_RDM2_16_H.
* To use register names with standard convension, please use PSI5_RDM2_16_H.
*/
#define PSI5_RDMH216 (PSI5_RDM2_16_H)

/** \brief 888, Receive Data Memory Low 217 */
#define PSI5_RDM2_17_L /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RDM_L*)0xF0005888u)
/** Alias (User Manual Name) for PSI5_RDM2_17_L.
* To use register names with standard convension, please use PSI5_RDM2_17_L.
*/
#define PSI5_RDML217 (PSI5_RDM2_17_L)

/** \brief 88C, Receive Data Memory High 217 */
#define PSI5_RDM2_17_H /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RDM_H*)0xF000588Cu)
/** Alias (User Manual Name) for PSI5_RDM2_17_H.
* To use register names with standard convension, please use PSI5_RDM2_17_H.
*/
#define PSI5_RDMH217 (PSI5_RDM2_17_H)

/** \brief 890, Receive Data Memory Low 218 */
#define PSI5_RDM2_18_L /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RDM_L*)0xF0005890u)
/** Alias (User Manual Name) for PSI5_RDM2_18_L.
* To use register names with standard convension, please use PSI5_RDM2_18_L.
*/
#define PSI5_RDML218 (PSI5_RDM2_18_L)

/** \brief 894, Receive Data Memory High 218 */
#define PSI5_RDM2_18_H /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RDM_H*)0xF0005894u)
/** Alias (User Manual Name) for PSI5_RDM2_18_H.
* To use register names with standard convension, please use PSI5_RDM2_18_H.
*/
#define PSI5_RDMH218 (PSI5_RDM2_18_H)

/** \brief 898, Receive Data Memory Low 219 */
#define PSI5_RDM2_19_L /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RDM_L*)0xF0005898u)
/** Alias (User Manual Name) for PSI5_RDM2_19_L.
* To use register names with standard convension, please use PSI5_RDM2_19_L.
*/
#define PSI5_RDML219 (PSI5_RDM2_19_L)

/** \brief 89C, Receive Data Memory High 219 */
#define PSI5_RDM2_19_H /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RDM_H*)0xF000589Cu)
/** Alias (User Manual Name) for PSI5_RDM2_19_H.
* To use register names with standard convension, please use PSI5_RDM2_19_H.
*/
#define PSI5_RDMH219 (PSI5_RDM2_19_H)

/** \brief 8A0, Receive Data Memory Low 220 */
#define PSI5_RDM2_20_L /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RDM_L*)0xF00058A0u)
/** Alias (User Manual Name) for PSI5_RDM2_20_L.
* To use register names with standard convension, please use PSI5_RDM2_20_L.
*/
#define PSI5_RDML220 (PSI5_RDM2_20_L)

/** \brief 8A4, Receive Data Memory High 220 */
#define PSI5_RDM2_20_H /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RDM_H*)0xF00058A4u)
/** Alias (User Manual Name) for PSI5_RDM2_20_H.
* To use register names with standard convension, please use PSI5_RDM2_20_H.
*/
#define PSI5_RDMH220 (PSI5_RDM2_20_H)

/** \brief 8A8, Receive Data Memory Low 221 */
#define PSI5_RDM2_21_L /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RDM_L*)0xF00058A8u)
/** Alias (User Manual Name) for PSI5_RDM2_21_L.
* To use register names with standard convension, please use PSI5_RDM2_21_L.
*/
#define PSI5_RDML221 (PSI5_RDM2_21_L)

/** \brief 8AC, Receive Data Memory High 221 */
#define PSI5_RDM2_21_H /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RDM_H*)0xF00058ACu)
/** Alias (User Manual Name) for PSI5_RDM2_21_H.
* To use register names with standard convension, please use PSI5_RDM2_21_H.
*/
#define PSI5_RDMH221 (PSI5_RDM2_21_H)

/** \brief 8B0, Receive Data Memory Low 222 */
#define PSI5_RDM2_22_L /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RDM_L*)0xF00058B0u)
/** Alias (User Manual Name) for PSI5_RDM2_22_L.
* To use register names with standard convension, please use PSI5_RDM2_22_L.
*/
#define PSI5_RDML222 (PSI5_RDM2_22_L)

/** \brief 8B4, Receive Data Memory High 222 */
#define PSI5_RDM2_22_H /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RDM_H*)0xF00058B4u)
/** Alias (User Manual Name) for PSI5_RDM2_22_H.
* To use register names with standard convension, please use PSI5_RDM2_22_H.
*/
#define PSI5_RDMH222 (PSI5_RDM2_22_H)

/** \brief 8B8, Receive Data Memory Low 223 */
#define PSI5_RDM2_23_L /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RDM_L*)0xF00058B8u)
/** Alias (User Manual Name) for PSI5_RDM2_23_L.
* To use register names with standard convension, please use PSI5_RDM2_23_L.
*/
#define PSI5_RDML223 (PSI5_RDM2_23_L)

/** \brief 8BC, Receive Data Memory High 223 */
#define PSI5_RDM2_23_H /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RDM_H*)0xF00058BCu)
/** Alias (User Manual Name) for PSI5_RDM2_23_H.
* To use register names with standard convension, please use PSI5_RDM2_23_H.
*/
#define PSI5_RDMH223 (PSI5_RDM2_23_H)

/** \brief 8C0, Receive Data Memory Low 224 */
#define PSI5_RDM2_24_L /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RDM_L*)0xF00058C0u)
/** Alias (User Manual Name) for PSI5_RDM2_24_L.
* To use register names with standard convension, please use PSI5_RDM2_24_L.
*/
#define PSI5_RDML224 (PSI5_RDM2_24_L)

/** \brief 8C4, Receive Data Memory High 224 */
#define PSI5_RDM2_24_H /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RDM_H*)0xF00058C4u)
/** Alias (User Manual Name) for PSI5_RDM2_24_H.
* To use register names with standard convension, please use PSI5_RDM2_24_H.
*/
#define PSI5_RDMH224 (PSI5_RDM2_24_H)

/** \brief 8C8, Receive Data Memory Low 225 */
#define PSI5_RDM2_25_L /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RDM_L*)0xF00058C8u)
/** Alias (User Manual Name) for PSI5_RDM2_25_L.
* To use register names with standard convension, please use PSI5_RDM2_25_L.
*/
#define PSI5_RDML225 (PSI5_RDM2_25_L)

/** \brief 8CC, Receive Data Memory High 225 */
#define PSI5_RDM2_25_H /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RDM_H*)0xF00058CCu)
/** Alias (User Manual Name) for PSI5_RDM2_25_H.
* To use register names with standard convension, please use PSI5_RDM2_25_H.
*/
#define PSI5_RDMH225 (PSI5_RDM2_25_H)

